#define _CRT_SECURE_NO_WARNINGS

#include <stdio.h>
#include <stdlib.h>
#include <string.h>

//int main()
//{
//	int player = 0;
//	int jude = 0;
//	scanf("%d",&player);
//	scanf("%d",&jude);
//	//int score[100] = {0};
//	int scor = 0;
//
//	while (player--)
//	{
//		int sum = 0;
//		for (int i = 0; i < jude; i++)
//		{
//			scanf("%d", &scor);
//			sum += scor;
//		}
//		printf("%.2lf\n", (sum * 1.0) / jude);
//	}
//	return 0;
//}

//5: 求平均分（函数）
//描述
//小
//f
//f结识了璃月的天权星凝光，受邀观看一场戏剧比赛。本场比赛是面向新人的，所以云堇等老一辈戏子会作为评委，对选手们的表现进行打分。本次比赛共有
//n
//n位选手，
//m
//m位评委，每位评委会对选手进行打分。正当小
//f
//f观看比赛时，比赛的负责人告诉他需要他帮忙计算各个选手的得分平均值，但是小
//f
//f不会，请你帮帮他。
//
//输入
//第一行两个数
//n
//,
//m
//n, m，表示选手个数与评委个数
//第二行到第
//n
//+
//1
//n + 1行每行
//m
//m个数，代表
//m
//m评委对第
//i
//i名选手的打分情况
//
//输出
//输出共
//n
//n行，每行一个数，表示该选手的得分平均值，结果需保留两位小数
//
//样例
//输入
//
//7 6
//4 7 2 6 10 7
//0 5 0 10 3 10
//2 6 8 4 3 6
//6 3 6 7 5 8
//5 9 3 3 8 1
//5 9 9 3 2 0
//5 8 0 4 1 10
//输出
//
//6.00
//4.67
//4.83
//5.83
//4.83
//4.67
//4.67
//提示
//1
//≤
//n
//,
//m
//≤
//100
//1≤n, m≤100，设选手分数为
//x
//x，则$x \in[0, 1000] $
//似乎并不需要将所有数据都记下来？