//1: 整除问题
//描述
//
//
//
//输入N个正整数，输出其中最小的能整除3的数。
//
//
//
//输入
//
//
//
//每行输入包含一组测试数据，包含N + 1个整数，之间用空格分隔。 第1个整数代表N(1 <= N <= 100)，后面N个整数是需要统计的数据。
//
//
//
//输出
//
//
//
//如果存在满足条件的数，那么输出该数，如果没有则输出Null。
//
//
//
//样例
//
//
//
//输入
//
//输出
//
//4 42 7 6 2
//4 1 4 7 13	6
//Null
//#define _CRT_SECURE_NO_WARNINGS
//#include<stdio.h>
//int main()
//{
//
//	int min = 1000000000;
//	int size = 0;
//	scanf("%d", &size);
//	int tp = 0;
//	for (int v = 0; v < size; v++)
//	{
//		scanf("%d", &tp);
//		if (tp % 3 == 0)
//		{
//			min = tp<min?tp:min;
//		}
//	}
//	if (min == 1000000000)
//	{
//		printf("Null");
//	}
//	else
//	{
//		printf("%d",min);
//	}
//	return 0;
//
//}