//1: 识别ISBN编码
//描述
//每一本正式出版的图书都有一个ISBN号码与之对应，ISBN码包括9位数字、1位识别码和3位分隔符，其规定格式如“x - xxx - xxxxx - x”，其中符号“ - ”是分隔符（键盘上的减号），最后一位是识别码，例如0 - 670 - 82162 - 4就是一个标准的ISBN码。ISBN码的首位数字表示书籍的出版语言，例如0代表英语；第一个分隔符“ - ”之后的三位数字代表出版社，例如670代表维京出版社；第二个分隔之后的五位数字代表该书在出版社的编号；最后一位为识别码。
//
//识别码的计算方法如下：
//首位数字乘以1加上次位数字乘以2……以此类推，用所得的结果mod 11，所得的余数即为识别码，如果余数为10，则识别码为大写字母X。例如ISBN号码0 - 670 - 82162 - 4中的识别码4是这样得到的：对0670 82162这9个数字，从左至右，分别乘以1，2，…，9，再求和，即0×1 + 6×2 + …… + 2×9 = 158，然后取158 mod 11的结果4作为识别码。
//
//你的任务是编写程序判断输入的ISBN号码中识别码是否正确，如果正确，则仅输出“Right”；如果错误，则输出你认为是正确的ISBN号码。
//
//输入
//输入只有一行，是一个字符序列，表示一本书的ISBN号码（保证输入符合ISBN的格式要求）。
//
//输出
//输入的ISBN号码的识别码正确，输出信息 “Right”。
//输入的ISBN号码的识别码错误，按照规定的格式，输出正确的ISBN号码（包括分隔符“ - ”）。
//
//样例1
//输入
//
//0 - 670 - 82162 - 4
//输出
//
//Right
//样例2
//输入
//
//0 - 670 - 82162 - 0
//输出
//
//0 - 670 - 82162 - 4
//#define _CRT_SECURE_NO_WARNINGS


//#include<stdio.h>
//int main()
//{
//	int a1 = 11;
//	int a2 = 12;
//	int a3 = 13;
//	int a4 = 14;
//	int a5 = 15;
//	int a6 = 16;
//	int a7 = 17;
//	int a8 = 18;
//	int a9 = 19;
//	int a10 = 20;
//	char a101 = 21;
//	int flag = 0;
//	scanf("%1d-%1d%1d%1d-%1d%1d%1d%1d%1d-", &a1, &a2, &a3, &a4, &a5, &a6, &a7, &a8, &a9);
//	if (!scanf("%1d", &a10))
//	{
//		scanf("%1c", &a101);
//		flag = 1;
//	}
//	int res = 0;
//	res = a1 + a2 * 2 + a3 * 3 + a4 * 4 + a5 * 5 + a6 * 6 + a7 * 7 + a8 * 8 + a9 * 9;
//	int rel = res % 11;
//	if (rel == 10 && flag == 1 && a101 == 'X')
//	{
//		printf("Right");
//		return 0;
//	}
//	if (rel != 10 && rel == a10 && flag == 0)
//	{
//		printf("Right");
//		return 0;
//	}
//	
//	if (rel == 10)
//	{
//		printf("%d-%d%d%d-%d%d%d%d%d-X",a1,a2,a3,a4,a5,a6,a7,a8,a9);
//	}
//	else
//	{
//		
//		printf("%d-%d%d%d-%d%d%d%d%d-%d", a1, a2, a3, a4, a5, a6, a7, a8, a9, rel);
//		
//	}
//}