#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//int main()
//{
//	int line = 0;
//	scanf("%d",&line);
//	while (line--)
//	{
//		int mod3 = 0;
//		int mod5 = 0;
//		int mod7 = 0;
//		scanf("%d",&mod3);
//		scanf("%d",&mod5);
//		scanf("%d",&mod7);
//
//		int flag = 0;
//		for (int i = 10; i <= 100; i++)
//		{
//			if (i % 3 == mod3 && i % 5 == mod5 && i % 7 == mod7)
//			{
//				printf("%d\n", i);
//				flag = 1;
//				break;
//			}
//		}
//		if (!flag)
//		{
//			printf("Impossible\n");
//		}
//	}
//
//	return 0;
//}


//5: 韩信点兵
//描述
//都听说过“韩信点兵，多多益善”这个成语，韩信才智过人，从不直接清点人数。只要让士兵
//3
//3 人一排，
//5
//5 人一排，
//7
//7 人一排的变换队形，查看队尾人数便能清点队伍总人数。
//
//输入
//第1行是一个整数
//n
//n，表示随后有
//n
//n 组数据。每组数据占一行，包括三种队形的队尾人数
//a
//,
//b
//,
//c
//a, b, c，用空格隔开。已知队伍总人数不小于
//10
//10，不大于
//100
//100。
//
//输出
//对每组数据，输出相应的队伍总人数，并换行。不存在则输出 Impossible，并换行。
//
//样例1
//输入
//
//2
//1 2 3
//2 3 2
//输出
//
//52
//23
//样例2
//输入
//
//3
//1 1 2
//2 4 6
//2 3 6
//输出
//
//16
//Impossible
//83