//3: 求两个整数之间的倒数和
//
//
//描述
//
//
//
//给定两个整数，求解这两个整数范围内的所有整数的倒数的总和。注意遇到整数0时，直接加上0。
//
//
//
//输入
//
//
//
//第1行是一个整数n，表示随后有n组数据。每组数据占一行，包含2个整数，a, b，用空格隔开。
//
//
//
//
//
//输出
//
//
//
//对每组数据输出范围(包含边界整数)之间相应的倒数和，要求保留三位小数，并换行。
//
//
//
//样例
//
//
//
//输入
//
//输出
//
//3
//
//1 1
//
//2 0
//
//- 1 1
//
//1.000
//
//1.500
//
//0.000
//
//
//
//提示
//
//
//
//整数中可能包含重复的整数。
//
//请按照下面的代码框架编写程序：
//
//
//
//#include <stdio.h>
//
//int main() {
//
//    int n, i;
//
//    scanf("%d", &n);  // 有n组数据
//
//    for (i = 0; i < n; i++) {
//
//        int a, b;
//
//        // 请将代码写在这里，注意整数0的情况
//
//    }
//
//
//
//    return 0;
//
//}
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//
//int main() {
//
//    int n, i;
//
//    scanf("%d", &n);  // 有n组数据
//
//    for (i = 0; i < n; i++) {
//
//        int a, b;
//        float sum = 0;
//        // 请将代码写在这里，注意整数0的情况
//        scanf("%d", &a);
//        scanf("%d", &b);
//        int min = a < b ? a : b;
//        int max = a > b ? a : b;
//        for (int j = min; j <= max; j++)
//        {
//            if(j!=0)
//            sum += 1.0 / j;
//        }
//        printf("%.3f\n", sum);
//    }
//
//
//
//    return 0;
//
//}