#define _CRT_SECURE_NO_WARNINGS

#include<stdio.h>

//1: 数字加密
//描述
//
//
//
//输入一个四位数，将其加密后输出。方法是将该数每一位上的数字加9，然后除以10取余，作为该位上的新数字，最后将百位和十位上的数字互换，千位和个位上的数字互换，组成加密后的新四位数V。
//
//
//
//输入
//
//
//
//在一行中输入一个四位数, 以回车结束。
//
//
//
//输出
//
//
//
//输出占一行，以回车结束。如果新数是合法的4位数则输出V，否则输出ERROR。
//
//
//
//样例
//
//
//
//输入
//
//输出
//
//1257
//
//6410
//

//int main()
//{
//	int input = 0;
//	scanf("%d", &input);
//	int arr[4] = {0};
//	int i = 0;
//	while (input)
//	{
//		arr[i] = input % 10;
//		input /= 10;
//		i++;
//	}
//	for (i = 0; i < 4; i++)
//	{
//		arr[i] = (arr[i] + 9) % 10;
//	}
//	if (!arr[0])
//	{
//		printf("ERROR");
//		return;
//	}
//	int sum = arr[3] + 10 * arr[2] + 100 * arr[1] + 1000 * arr[0];
//	printf("%d", sum);
//	return 0;
//}