#define _CRT_SECURE_NO_WARNINGS


//#include<stdio.h>
//#include<math.h>
//int main()
//{
//	long long sum = 0;
//	int arr[32] = { -1 };
//	int num = 32;
//	while (num--)
//	{
//		scanf("%d", arr + (32 - num-1));
//	}
//	for (int i = 0; i < 32; i++)
//	{
//
//		if (arr[i])
//		{
//			sum += pow(2,i);
//		}
//	}
//	printf("%lld", sum);
//	return 0;
//}


//1: 你知道吗（分支）
//描述
//你知道吗，有的时候汉字的序顺并不一影定响阅读。
//
//Coi 偶然得到了一个包含 32 个整数的序列
//A
//=
//(
//	A
//	0
//	,
//	A
//	1
//	,
//	…
//	,
//	A
//	31
//	)
//	A = (A
//		0
//		​
//		, A
//		1
//		​
//		, …, A
//		31
//		​
//		)，序列的每个元素都只有两个取值
//	0
//	0 和
//	1
//	1。
//
//	但是只有
//	0
//	0 和
//	1
//	1 导致 Coi 有的时候并不能准确判断这个序列是否被熊孩子动过，于是他准备将这个序列依照一种关系转换成一个数
//	x
//	x，这样辨识度就高了。
//
//	定义
//	x
//	=
//	A
//	0
//	2
//	0
//	+
//	A
//	1
//	2
//	1
//	+
//	⋯
//	+
//	A
//	31
//	2
//	31
//	x = A
//	0
//	​
//	2
//	0
//	+ A
//	1
//	​
//	2
//	1
//	+ ⋯ + A
//	31
//	​
//	2
//	31
//	，求
//	x
//	x。
//
//	输入
//	一行 32 个整数
//	A
//	0
//	,
//	A
//	1
//	,
//	…
//	,
//	A
//	31
//	A
//	0
//	​
//	, A
//	1
//	​
//	, …, A
//	31
//	​
//	。
//
//	输出
//	一行一个整数
//	x
//	x。
//
//	样例
//	输入
//
//	1 0 1 1 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0
//	输出
//
//	13
//	提示
//	数据范围：对于
//	0
//	≤
//	n
//	≤
//	31
//	0≤n≤31，
//	A
//	n
//	=
//	0
//	A
//	n
//	​
//	= 0 或
//	1
//	1。
//
//	请使用恰当的数据类型存储答案。
//
//	请从标准输入读入数据，将结果输出到标准输出。