//2: 温度转换
//描述
//
//
//
//写一个程序，按照下面的公式进行温度转换。从键盘输入F（华氏度），从屏幕输出C（摄氏度），精确到2位小数点。 C = （5 / 9）（F - 32）
//
//
//
//输入
//
//
//
//输入F是一个正整数。
//
//
//
//输出
//
//
//
//如果F输入一个正整数那么输出对应的C值，否则请输出error，输出结尾需要换行结尾。
//
//
//
//样例
//
//
//
//输入
//
//输出
//
//2
//
//0
//
//50
//
//- 16.67
//
//error
//
//10.00
//#define _CRT_SECURE_NO_WARNINGS
//
//#include<stdio.h>
//int main()
//{
//	float resl = 0.0;
//	int input = 0;
//	scanf("%d", &input);
//	if (input <= 0)
//	{
//		printf("error");
//		return 0;
//	}
//	else
//	{
//		resl = (5.0 / 9) * (input - 32);
//	}
//	printf("%.2f", resl);
//
//
//}