#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

//int main()
//{
//	int n;
//	while (scanf("%d", &n) == 1) 
//	{
//		int flag = 0;
//		for (int a = 0; a < 10; a++)
//		{
//			for (int b = 0; b < 10; b++)
//			{
//				for (int c = 0; c < 10; c++)
//				{
//					int num1 = 100 * a + 10 * b + c;
//					int num2 = 100 * c + 10 * b + a;
//					if (n == num1 + num2)
//					{
//						flag = 1;
//						printf("%d,%d,%d\n",a,b,c);
//					}
//				}
//			}
//		}
//		if (!flag)
//		{
//			printf("-1\n");
//		}
//		
//
//
//	}
//
//
//	return 0;
//}

//4: 求解a, b, c（程序设计基础第1次月测编程2）
//描述
//假设输入一个正整数
//n
//n，
//n
//n 满足 :
//n
//=
//a
//b
//c
//+
//c
//b
//a
//n = abc + cba，
//a
//,
//b
//,
//c
//a, b, c 分别代表0～9数字，求出
//a
//,
//b
//,
//c
//a, b, c 分别代表的什么数，给出所有的可能值，例如
//1333
//=
//419
//+
//914
//1333 = 419 + 914。
//
//若
//n
//n 无法满足这个要求，即
//n
//≠
//a
//b
//c
//+
//c
//b
//a
//n
//
//​
//= abc + cba ，则输出 - 1。
//
//输入
//连续输入若干组数据，每组数据占1行，每行有1个正整数。
//
//输出
//按照
//a
//a 升序输出所有的可能值，每种结果
//a
//,
//b
//,
//c
//a, b, c 之间用","隔开，不同结果之间采用换行隔开。
//
//若这样的
//a
//,
//b
//,
//c
//a, b, c 不存在，则输出 - 1。
//
//样例
//输入
//
//786
//258
//输出
//
//0, 9, 6
//1, 9, 5
//2, 9, 4
//3, 9, 3
//4, 9, 2
//5, 9, 1
//6, 9, 0
//- 1
//提示
//int n;
//while (scanf("%d", &n) == 1) {
//	// 求解a, b, c
//}