//4: 解方程
//描述
//输入三个整数
//a
//,
//b
//,
//c
//a, b, c，求解方程
//a
//x
//2
//+
//b
//x
//+
//c
//=
//0
//ax
//2
//+ bx + c = 0
//
//输入
//多组数据，每组数据中一行依次输入三个整数
//a
//,
//b
//,
//c
//a, b, c，数字间用逗号隔开。
//
//输出
//如果方程有两个不同的实数解，则按先大后小的顺序输出两个解，结果保留2位小数，中间用空格隔开。如果两个实数解相等或只有一个实数解，则只输出一个。
//
//如果方程没有实数解或有无穷多个解，输出字符x。
//
//注意，输出单独占一行，且末尾无多余空格。
//
//样例
//输入
//
//2, 1, -3
//3, 4, 1
//0, 0, 0
//输出
//
//1.00 - 1.50
//- 0.33 - 1.00
//x
//提示
//可以参考下面的代码片段读入数据，并判断是否已经处理完毕
//
//int a, b, c;
//while (scanf("%d,%d,%d", &a, &b, &c) == 3) {
//    // 解方程
//}
//#define _CRT_SECURE_NO_WARNINGS
//#include <stdio.h>
//#include <math.h>
//
//int main() 
//{
//	int a, b, c;
//	while (scanf("%d,%d,%d", &a, &b, &c) == 3)
//	{
//		// 解方程
//		if (a == 0&&b!=0)//一次方程
//		{
//			printf("%.2f\n", 0 - (c*1.0)/ b);
//			continue;
//		}
//		if (a == 0 && b == 0)//常数或无解
//		{
//			printf("x\n");	
//			continue;
//		}
//		//二次方程
//		if (b * b - 4 * a * c < 0)//无解
//		{
//			printf("x\n");
//			continue;
//		}
//		if (b * b - 4 * a * c == 0)//一解
//		{
//			printf("%.2f\n", (0-b)/(2.0*a));
//			continue;
//		}
//		if (b * b - 4 * a * c > 0)//二解
//		{
//			printf("%.2f %.2f\n", (0 - b+sqrt(b * b - 4 * a * c)) / (2.0 * a), (0 - b - sqrt(b * b - 4 * a * c)) / (2.0 * a));
//			continue;
//		}
//	}
//}